tap "charmbracelet/tap"
tap "isen-ng/dotnet-sdk-versions"
tap "oven-sh/bun"
tap "steveyegge/beads"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Asynchronous DNS library
brew "c-ares"
# Diff that understands syntax
brew "difftastic"
# Pack, ship and run any application as a lightweight container
brew "docker"
# .NET Core
brew "dotnet@6"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@75"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Bare libuv bindings for lua
brew "luv"
# CLI for Mermaid library
brew "mermaid-cli"
# Tool for smooth Git handover in mob programming sessions
brew "mob"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Text-based UI library
brew "ncurses"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl compatible regular expressions library
brew "pcre"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Fast, disk space efficient package manager
brew "pnpm"
# Parse HTML at the command-line
brew "pup"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# LSP for TailwindCSS
brew "tailwindcss-language-server"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# AI-supervised issue tracker for coding workflows
brew "steveyegge/beads/bd"
# Tools for building Android applications
cask "android-studio"
# Chromium based browser
cask "arc"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Tool to manage periodic breaks
cask "breaktimer"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Developer platform
cask "dotnet-sdk"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk6"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk6-0-400"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8-0-400"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk9"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk9-0-300"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Kubernetes and container management on the desktop
cask "rancher"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# .NET IDE
cask "rider"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "vscodevim.vim"
